<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Model;

/**
 * Медиа файлы
 *
 * Class ProjectImage
 * @package App\Models
 *
 * @property int id
 * @property int project_id - id проекта
 * @property int image_id - id изображения
 *
 */
class ProjectImage extends Model
{

    /*
    |--------------------------------------------------------------------------
    | GLOBAL VARIABLES
    |--------------------------------------------------------------------------
    */
    public const TABLE = 'project_image';

    /** @var string */
    protected $table = self::TABLE;

    /**
     * Indicates if the model should be timestamped.
     *
     * @var bool
     */
    public $timestamps = false;

    protected $fillable = [
        'project_id',
        'image_id',
    ];

    protected $casts = [
        'project_id' => 'integer',
        'image_id' => 'integer',
    ];

    /*
    |--------------------------------------------------------------------------
    | FUNCTIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | RELATIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | SCOPES
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | ACCESSORS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | MUTATORS
    |--------------------------------------------------------------------------
    */
}
